<template>
  <v-container fluid>
    <v-card max-width="750px" class="mx-auto">
      <CardHeader :show-back-button="false" />
      <v-card-text class="font-size-normal">
        <h3 class="text-center">
          2022年度野田地区理大祭来場者予約システムプライバシーポリシー
        </h3>
        <v-divider class="mt-2" />

        <p class="mt-4">
          このプライバシーポリシー（以下、「本ポリシー」という。）は、2022年度東京理科大学野田地区理大祭実行委員会（以下、「実行委員会」という。）の
          来場者予約システム（以下、「本システム」という。）における、ユーザーについての個人情報を含む利用者情報の取り扱いについて定めるものです。
        </p>

        <h4 class="mt-4">
          １.収集する利用者情報および収集方法
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に関わる情報・通信サービス上の行動履歴・その他ユーザーまたはユーザーの端末に関連して生成・集積された情報であって、
          本ポリシーに基づき実行委員会が収集するものを意味するものとします。
          本システムにおいて、実行委員会が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。
          <ol class="mt-2">
            <li>
              ユーザーからご提供いただく情報
              <p class="mt-2">
                本システムを利用するために、または本システムの利用を通じてユーザーからご提供いただく情報は以下の通りです。
              </p>
              <ul class="mt-2">
                <li class="mt-2">
                  氏名（漢字・よみ）のプロフィールに関する情報
                </li>
                <li class="mt-2">
                  メールアドレス・電話番号の連絡先に関する情報
                </li>
                <li class="mt-2">
                  クレジットカード情報の決済手段に関する情報
                </li>
                <li class="mt-2">
                  入力フォームや、その他実行委員会が定める方法を通じてユーザーが入力または送信する情報
                </li>
              </ul>
            </li>

            <li class="mt-2">
              ユーザーが本システムを利用するにあたって実行委員会が収集する情報
              <p class="mt-2">
                実行委員会は、本システムのアクセス状況やそのご利用方法に関する情報を収集することがあります。これには以下の情報が含まれます。
              </p>
              <ul class="mt-2">
                <li class="mt-2">
                  IPアドレス
                </li>
                <li class="mt-2">
                  サーバーアクセスログに関する情報
                </li>
                <li class="mt-2">
                  Cookieなどの識別子
                </li>
              </ul>
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          ２.利用目的
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          本システムのサービス提供に関わる利用者情報の具体的な使用目的は以下の通りです。
          <ol class="mt-2">
            <li>
              本サービスに関わる登録の受付、本人確認、ユーザー認証、イベント料金の計算等本サービスの提供、維持、保護及び改善のため
            </li>

            <li class="mt-2">
              ユーザーのトラフィック測定及び行動測定のため
            </li>

            <li class="mt-2">
              本サービスに関するご案内、お問い合わせ等への対応のため
            </li>

            <li class="mt-2">
              本サービスに関する実行委員会の規約、ポリシー等（以下、「規約等」といいます。）に違反する行為に対する対応のため
            </li>

            <li class="mt-2">
              本サービスに関する規約等の変更などを通知するため
            </li>

            <li class="mt-2">
              新型コロナウイルス感染症拡大防止のため、行政等の追跡調査に応じる場合があるため
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          ３.利用中止要請の方法
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          ユーザーは、実行委員会に申し出ることにより、利用者情報の全部または一部についてその収集または利用の停止を求めることができ、この場合、実行委員会は速やかに、その利用を停止します。
          ただし、利用者情報の項目によっては、その収集または利用が本サービスの前提となるため、実行委員会に申し出ることにより本サービスを退会した場合に限り、実行委員会はその収集または利用を停止します。
        </div>

        <h4 class="mt-4">
          ４.外部送信、第三者提供、情報収集モジュールの有無
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          本サービスには以下の情報収集モジュールが組み込まれています。
          これに伴い、以下の通り情報収集モジュール提供者（日本国外にある者を含みます。）への利用者情報の提供を行います。
          <ol class="mt-2">
            <li>
              情報収集モジュールの名称：Stripe
            </li>
            <li class="mt-2">
              情報収集モジュールの提供者：Stripe, Inc.
            </li>
            <li class="mt-2">
              提供される利用者情報の項目：クレジットカード情報
            </li>
            <li class="mt-2">
              提供の手段・方法：Stripeの提供する決済サービスへのリダイレクト
            </li>
            <li class="mt-2">
              上記利用提供者のプライバシーポリシーのURL：<a href="https://stripe.com/jp/privacy" target="_blank">https://stripe.com/jp/privacy</a>
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          ５.第三者提供
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          実行委員会は、利用者情報のうち、個人情報については、あらかじめユーザーの同意を得ないで、第三者（日本国外にある者を含みます。）に提供しません。
          ただし、次に掲げる必要があり、第三者（日本国外にあるものを含みます。）に提供する場合はこの限りではありません。
          <ol class="mt-2">
            <li>
              第４項の定めに従って、提携先または情報収集モジュール提供者へ個人情報が提供される場合
            </li>

            <li class="mt-2">
              国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザーの同意を得ることによって当該事務の遂行に支障を及ぼす恐れがある場合
            </li>

            <li class="mt-2">
              その他、個人情報の保護に関する法律（以下「個人情報保護法」といいます。）その他の法令で認められる場合
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          ６.個人情報の開示
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          実行委員会は、ユーザーから、個人情報保護法の定めに基づき個人情報の開示を求められたときは、ユーザーご本人からの請求であることを確認の上で、ユーザーに対し、遅滞なく開示を行います。
          （当該個人情報が存在しないときにはその旨を通知いたします。）
          ただし、個人情報保護法その他の法令により、実行委員会が開示の義務を負わない場合には、この限りではありません。
        </div>

        <h4 class="mt-4">
          ７.個人情報の修正及び利用停止等
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          <ol class="mt-2">
            <li>
              実行委員会は、ユーザーから、(1)個人情報が真実でないという理由によって個人情報保護法の定めに基づきその内容の訂正を求められた場合、
              及び(2)あらかじめ公表された利用目的の範囲を超えて取り扱われているという理由または偽りその他不正の手段により収集されたものであるという理由により、
              個人情報保護法の定めに基づきその利用の停止を求められた場合には、ユーザーご本人からのご請求であることを確認の上で遅滞なく必要な調査を行い、
              その結果に基づき、個人情報の内容の修正または利用停止を行い、その旨をユーザーに通知します。
              なお、修正または利用停止を行わない旨の決定をした時には、ユーザーに対しその旨を通知します。
            </li>

            <li class="mt-2">
              実行委員会は、ユーザーから、ユーザーの個人情報について削除を求められた場合、実行委員会が当該請求に応じる必要があると判断した場合は、
              ユーザーご本人からのご請求であることを確認の上で、個人情報の削除を行い、その旨をユーザーに通知します。
            </li>

            <li class="mt-2">
              個人情報保護法その他の法令のより、実行委員会が修正等または利用停止等の義務を負わない場合には、7-1及び7-2の規定は適用されません。
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          ８.お問い合わせ窓口
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          ご意見、ご質問、苦情のお申し出その他利用者情報の取り扱いに関するお問い合わせは、下記の窓口までお願いいたします。
          <ul class="mt-2">
            <li>
              住所：&#12306;278-8510 千葉県野田市山崎2641番地 部室棟 E-209 学生会本部
            </li>
            <li class="mt-2">
              実行委員長：木村 真心
            </li>
            <li class="mt-2">
              メールアドレス：<a href="mailto:support@nodaridaisai.net">support@nodaridaisai.net</a>
            </li>
          </ul>
        </div>

        <h4 class="mt-4">
          ９.プライバシーポリシーの変更手続き
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-2">
          実行委員会は、必要に応じて、本ポリシーを変更します。
          ただし、法令上ユーザーの同意を必要とするような本ポリシーの変更を行う場合、変更後の本ポリシーは、実行委員会所定の方法で変更に同意したユーザーに対してのみ適用されるものとします。
          なお、実行委員会は、本ポリシーを変更する場合には、変更後の本ポリシーの施行時期及び内容を理大祭ウェブサイト等その他適切な方法により周知し、またはユーザーに通知します。
        </div>

        <div class="mt-4">
          <h5>
            2022年10月31日制定
          </h5>
        </div>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<script lang="ts">
import { Component, Vue } from 'nuxt-property-decorator'
import CardHeader from '~/components/ui/CardHeader.vue'

@Component({
  head: {
    title: 'プライバシーポリシー'
  },
  components: {
    CardHeader
  }
})
export default class Privacy extends Vue {

}
</script>

<style scoped>
.font-size-normal {
  font-size: 16px;
  line-height: 25px;
}
</style>
