<template>
  <v-container fluid>
    <v-card max-width="750px" class="mx-auto">
      <CardHeader :show-back-button="false" />
      <v-card-text class="font-size-normal">
        <h3 class="text-center">
          2022年度野田地区理大祭来場者予約システム利用規約
        </h3>
        <v-divider class="mt-2" />

        <p class="mt-4">
          この利用規約（以下、「本規約」という。）は、2022年度東京理科大学野田地区理大祭実行委員会（以下、「実行委員会」という。）の
          来場者予約システム（以下、「本システム」という。）を利用するにあたって、ユーザー登録ならびに来場予約を行う者（以下、「ユーザー」という。）
          が同意する必要のある項目を定めることを目的としたものです。
        </p>

        <h4 class="mt-4">
          第１条（適用）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          <ol>
            <li>
              本規約は、ユーザーと実行委員会との間の本システムの利用に関わる一切の関係に適用されるものとします。
            </li>
            <li class="mt-2">
              実行委員会は、本システムの利用にあたって、本規約の他、必要とされる各種の定め（以下、「個別規約」という。）をすることがあります。<br>
              これらの個別規約は、その名称のいかんに関わらず、本規約の一部を構成するものとします。
            </li>
            <li class="mt-2">
              本規約の規定が、個別規定で定められた規定と矛盾する場合、個別規定において特段の定めがない限り、個別規定の規定が優先されるものとします。
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          第２条（ユーザー登録）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            本システムにおいては、ユーザーが本規約に同意の上、本システム上で定めるユーザー登録を行うことにより利用登録が終了するものとします。
          </li>
          <li class="mt-2">
            ユーザー登録をしようとする者が未成年である場合、親権者など法的代理人の同意（本規約への同意を含む）を得た上でユーザー登録を行うものとします。<br>
          </li>
        </ol>

        <h4 class="mt-4">
          第３条（ユーザーの義務）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          ユーザーは、以下の各号を遵守しなければなりません。
          <ol class="mt-3">
            <li>
              本システム上で示される実行委員会からの連絡を確認すること。
            </li>
            <li class="mt-2">
              本システム上の不具合や脆弱性等を発見した場合には、速やかに実行委員会（
              <a href="mailto:sysadmin@nodaridaisai.com">
                systemadmin@nodaridaisai.com
              </a>
              ）まで報告すること。
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          第４条（登録情報の変更）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          ユーザーは、登録情報に変更があった場合、実行委員会が定める方法により、当該変更事項を遅滞なく実行委委員会に通知するものとします。
        </div>

        <h4 class="mt-4">
          第５条（パスワードの管理）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          <ol>
            <li>ユーザーは、自己の責任において、本システムのパスワードを適切に管理するものとします。</li>
            <li class="mt-2">
              ユーザーは、いかなる場合であっても、本システムに登録したメールアドレス、並びにパスワード（以下、「認証情報」という。）
              を第三者に譲渡、貸与、名義変更、売買等をし、もしくは第三者と共用することはできません<br>
              実行委員会は、認証情報の組み合わせが本システムに登録された内容と一致してログインされた場合は、
              その認証情報を登録しているユーザー自身による利用とみなします。
            </li>
            <li class="mt-2">
              認証情報の管理不十分、使用上の過誤、第三者の利用等によって生じた損害に関する責任は、該当ユーザーが負うものとします。
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          第６条（禁止事項）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          ユーザーは、本システムを利用するにあたって、以下の各号に掲げる行為をしてはなりません。
          <ol class="mt-3">
            <li>公序良俗に反する行為。</li>
            <li class="mt-2">
              法令に違反する行為、または犯罪行為に関連する行為。<br>
              ただし、ここでいう法令ならびに犯罪行為とは、日本法に準拠するものとする。
            </li>
            <li class="mt-2">
              実行委員会、本ポータルの他のユーザーまたは第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他権利または利益を侵害する行為。
            </li>
            <li class="mt-2">
              実行委員会、本システムの他のユーザー、その他第三者のサーバまたはネットワークの機能を破壊したり、妨害したりする行為。
            </li>
            <li class="mt-2">
              実行委員会の2022年度東京理科大学野田地区理大祭（以下「理大祭」という。）の運営を妨害する恐れのある行為。
            </li>
            <li class="mt-2">
              不正アクセスをし、またはそれを試みる行為。
            </li>
            <li class="mt-2">
              本システムに対するリバースエンジニアリングやその他の解析行為。
            </li>
            <li class="mt-2">
              本システムを通じ、以下に該当し、または該当すると実行委員会が判断する情報を実行委員会に送信する行為。
              <ul class="mt-3">
                <li>過度に暴力的または残虐な表現を含む情報</li>
                <li class="mt-2">
                  コンピュータ・ウイルス、その他有害なコンピュータ・プログラムを含む情報
                </li>
                <li class="mt-2">
                  実行委員会、本システムの他のユーザーまたはその他の第三者の名誉または信頼を毀損する表現を含む情報
                </li>
                <li class="mt-2">
                  過度にわいせつな表現を含む情報
                </li>
                <li class="mt-2">
                  差別を助長する表現を含む情報
                </li>
                <li class="mt-2">
                  自殺や自傷行為を助長する表現を含む情報
                </li>
                <li class="mt-2">
                  薬物の不適切な利用を助長する表現を含む情報
                </li>
                <li class="mt-2">
                  反社会的な表現を含む情報
                </li>
                <li class="mt-2">
                  他人に不快感を与える表現を含む情報
                </li>
              </ul>
            </li>
            <li class="mt-2">
              他のユーザーになりすます行為。
            </li>
            <li class="mt-2">
              その他、実行委員会が不適切と判断する行為。
            </li>
          </ol>
        </div>

        <h4 class="mt-4">
          第７条（本システムの提供の停止等）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          実行委員会は、以下の各号のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本システムの全部、
          または一部の機能の提供を停止、または中断できるものとします。
        </div>
        <ol class="mt-3">
          <li>本システムにかかるコンピュータシステム、またはネットワーク機器の保守点検、または更新を緊急に行う場合。</li>
          <li class="mt-2">
            地震、落雷、火災、停電、天災などの不可抗力により、本システムの提供が困難となった場合。
          </li>
          <li class="mt-2">
            コンピュータ、または通信回線等が事故により停止した場合。
          </li>
          <li class="mt-2">
            その他、実行委員会が本システムの提供を停止、または中断することが妥当であると判断した場合。
          </li>
        </ol>

        <h4 class="mt-4">
          第８条（権利帰属）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            ユーザーは、本システムを通じて実行委員会に送信した投稿データ（文章、画像、動画、その他のデータを含むがこれらに限らない。以下同じ。）に関して、
            自らが投稿、その他送信することについての適法な権利を有していること、および投稿データが第三者の権利を侵害していないことについて、
            実行委員会に対し表明し、保証するものとします。
          </li>
          <li class="mt-2">
            ユーザーは、本システムを通じて実行委員会に送信した投稿データについて、実行委員会に対し、理大祭を円滑に運営するため、
            世界的、非独占的、無償的、サブライセンス可能かつ譲渡可能な使用、複製、配布、派生著作物の作成、表示および実行に関するライセンスを付与するものとします。
          </li>
          <li class="mt-2">
            コンピュータ、または通信回線等が事故により停止した場合。
          </li>
          <li class="mt-2">
            その他、実行委員会が本システムの提供を停止、または中断することが妥当であると判断した場合。
          </li>
        </ol>

        <h4 class="mt-4">
          第８条（権利帰属）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            ユーザーは、本システムを通じて実行委員会に送信した投稿データ（文章、画像、動画、その他のデータを含むがこれらに限らない。以下同じ。）に関して、
            自らが投稿、その他送信することについての適法な権利を有していること、および投稿データが第三者の権利を侵害していないことについて、
            実行委員会に対し表明し、保証するものとします。
          </li>
          <li class="mt-2">
            ユーザーは、本システムを通じて実行委員会に送信した投稿データについて、実行委員会に対し、理大祭を円滑に運営するため、
            世界的、非独占的、無償的、サブライセンス可能かつ譲渡可能な使用、複製、配布、派生著作物の作成、表示および実行に関するライセンスを付与するものとします。
          </li>
          <li class="mt-2">
            コンピュータ、または通信回線等が事故により停止した場合。
          </li>
          <li class="mt-2">
            その他、実行委員会が本システムの提供を停止、または中断することが妥当であると判断した場合。
          </li>
        </ol>

        <h4 class="mt-4">
          第９条（登録抹消）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            実行委員会は、ユーザーが以下の各号のいずれかの事由に該当する場合は、事前に通知または催告することなく、
            当該ユーザーについて本システムの利用を一時的に停止し、またはユーザーとしての登録を抹消することができるものとします。
            <ol class="mt-3">
              <li>
                登録情報に虚偽の事実があることが判明した場合。
              </li>
              <li class="mt-2">
                第６条の各号に該当する行為を行った場合。
              </li>
              <li class="mt-2">
                過去に本規約に違反したことがある者からのユーザー登録である場合。
              </li>
              <li class="mt-2">
                不正なシステム利用が確認された場合。
              </li>
              <li class="mt-2">
                反社会的勢力等（暴力団、暴力団員、右翼団体、反社会的勢力、その他これに準ずる者を意味します。以下同じ。）である、
                または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等、
                反社会的勢力等との何らかの交流もしくは関与を行っていると実行委員会が判断した場合。
              </li>
              <li class="mt-2">
                その他、実行委員会が本システムの利用またはユーザーとしての登録の継続を適当でないと判断した場合。
              </li>
            </ol>
          </li>
        </ol>

        <h4 class="mt-4">
          第１０条（退会）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            ユーザーは、本システムで定める退会手続きを行うことにより、本システムから退会できるものとします。
          </li>
          <li class="mt-2">
            退会後のユーザーの登録情報の取り扱いについては、第１３条の規定に従うものとします。
          </li>
        </ol>

        <h4 class="mt-4">
          第１１条（免責事項）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          実行委員会は、本システムがユーザーの特定の目的に適合すること、期待する機能・正確性・有用性を有すること、
          ユーザーによる本システムの利用がユーザーに適用のある法令または団体等の内部規則等に適合すること、継続的に利用できること、
          および不具合が生じないことについて、明示または黙示を問わず何ら保証するものではありません。
        </div>

        <h4 class="mt-4">
          第１２条（秘密保持）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          ユーザーは、本システムに関連して、実行委員会がユーザーに対して秘密に取扱うことを求めて開示した非公知の情報について、
          実行委員会の事前の承諾がある場合を除き、秘密に取扱うものとします。
        </div>

        <h4 class="mt-4">
          第１３条（個人情報の取り扱い）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            実行委員会によるユーザーの個人情報の取扱いについては、別途実行委員会が定める
            <a href="/privacy">プライバシーポリシー</a>
            の定めによるものとし、 ユーザーはこのプライバシーポリシーに従って実行委員会がユーザーの個人情報を取扱うことについて同意するものとします。
          </li>
          <li class="mt-2">
            実行委員会は、ユーザーが実行委員会に提供した情報、データ等を、個人の特定できない形での統計的な情報として、
            実行委員会の裁量で、利用及び公開することができるものとし、ユーザーはこれに意義を唱えないものとします。
          </li>
        </ol>

        <h4 class="mt-4">
          第１４条（本規約等の変更）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          実行委員会は、実行委員会が必要と認めた場合は、本規約を変更できるものとします。本規約を変更する場合は、
          変更後の本規約の施行時期および内容を、本システム上での掲示その他適切な方法により周知し、またはユーザーに通知します。
          ただし、法令上ユーザーの同意が必要となるような内容の変更の場合は、実行委員会所定の方法によりユーザーの同意を得るものとします。
        </div>

        <h4 class="mt-4">
          第１５条（連絡・通知）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            本システムに関する問い合わせ、ユーザーから実行委員会に対する連絡または通知、及び本規約の変更に関する通知、その他当社からユーザー
            に対する連絡または通知は、メールにより行うものとします。
          </li>
          <li class="mt-2">
            実行委員会が登録事項に含まれるメールアドレスに連絡または通知を行った場合、ユーザーは当該連絡または通知を受領したものとみなします。
          </li>
        </ol>

        <h4 class="mt-4">
          第１６条（サービス利用契約上の地位の譲渡等）
        </h4>
        <v-divider class="mt-2" />
        <div class="mt-4">
          ユーザーは、実行委員会の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務につき、
          第三者に対して、譲渡、移転、担保設定、その他の処分をすることはできません。
        </div>

        <h4 class="mt-4">
          第１７条（準拠法および管轄裁判所）
        </h4>
        <v-divider class="mt-2" />
        <ol class="mt-4">
          <li>
            本システムの利用にあたっては、日本法を準拠法とします。
          </li>
          <li class="mt-2">
            本システムの利用に関わる全ての紛争に関しては、その訴額に応じて東京地方裁判所又は東京簡易裁判所を第一審の専属管轄裁判所とします。
          </li>
        </ol>

        <div class="mt-4">
          <h5>
            2022年8月24日制定
          </h5>
        </div>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<script>
import { Component, Vue } from 'nuxt-property-decorator'
import CardHeader from '~/components/ui/CardHeader'

@Component({
  head: {
    title: '利用規約'
  },
  components: {
    CardHeader
  }
})
export default class Terms extends Vue {

}
</script>

<style scoped>
.font-size-normal {
  font-size: 16px;
  line-height: 25px;
}
</style>
